Revit 2026 API

# TrussChordLocation Enumeration

---

This enumerated type represents the options for the Truss Chord Location.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TrussChordLocation
```
```vb
Public Enumeration TrussChordLocation
```
```cpp
public enum class TrussChordLocation
```
```fsharp
type TrussChordLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 0 | The bottom chord of the Truss. |
| Top | 1 | The top chord of the Truss. |

#### Reference

Autodesk.Revit.DB.Structure Namespace